// Задача 4

// 1.Вивести в консоль в один рядок через кому числа від 10 до 20.
// 2.Вивести в консоль в один рядок через кому квадрати чисел від 10 до 20.
// 3.Знайти добуток усіх цілих чисел від 15 до 35.
// 4.Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
// 5.Вивести суму лише парних чисел в діапазоні від 30 до 80.
// 6.Вивести всі числа в діапазоні від 100 до 200 кратні 3.
// ------------------------------------------
console.log('1 Приклад: ')
let a = '';
for (i = 10; i <= 20; i++){
    (i <= 19)? a += i + ',': a += i + '.';
}
console.log(a);
// ------------------------------------------
console.log('2 Приклад: ')
square = '';
for (let i = 10; i<= 20; i++){
    (i <= 19)? square += i**2 + ',': square += i**2 + '.';
}
console.log(square)
// -----------------------------------------
console.log('3 Приклад: ')
let count = 1;
for (i = 15; i <=35; i++){
    count = count * i;
}
console.log(count);
// ------------------------------------------
console.log('4 Приклад: ')
count = 0
for (i = 1; i <=500; i++){
    count = count + i;
}
console.log(count/500);
// ------------------------------------------
console.log('5 Приклад: ')
count = 0;
for (i = 30; i<=80; i++){
    if (i % 2 == 0) {
        count = count + i
    }
}
console.log(count);
// ------------------------------------------
console.log('6 Приклад: ')
arr = [];
for (i = 100; i <= 200; i++){
    if (i % 3 == 0){
        arr.push(i);
    }
}
console.log(arr)